Revit 2027 API
BarTypeDiameterOptions Constructor
 Constructs a new BarTypeDiameterOptions with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BarTypeDiameterOptions()
Public Sub New
public:
BarTypeDiameterOptions()
new : unit -> BarTypeDiameterOptions
See Also
Reference
BarTypeDiameterOptions Class
BarTypeDiameterOptions Overload
Autodesk.Revit.DB Namespace